20-rails-review/brews-crew/app/controllers/brews_controller.rb

SELECT "brews".* FROM "brews"
---
    def index
        @brews = Brew.all

INSERT INTO "brews" ("blend_name", "origin", "notes", "strength", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["blend_name", "TESTING"], ["origin", "dirt, mud"], ["notes", "delicious"], ["strength", 5], ["created_at", "2019-07-25 18:31:23.103407"], ["updated_at", "2019-07-25 18:31:23.103407"]]
---
    def create
        @brew = Brew.create(brews_params)

SELECT  "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @brew = Brew.find(params[:id])

SELECT  "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "brews" SET "notes" = ?, "updated_at" = ? WHERE "brews"."id" = ?  [["notes", "juicy, juicy, fresh wood, smokey, hops"], ["updated_at", "2019-07-25 18:33:51.042759"], ["id", 2]]
---
    def update
        @brew = Brew.find(params[:id])
        @brew.update(brews_params)

SELECT  "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @brew = Brew.find(params[:id])

SELECT  "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "brews" WHERE "brews"."id" = ?  [["id", 1]]
---
    def destroy
        @brew = Brew.find(params[:id])
        @brew.delete