20-rails-review/brews-crew/app/controllers/purchases_controller.rb

SELECT "brews".* FROM "brews"
---
    def new
        @purchase = Purchase.new
        @brews = Brew.all

SELECT "brews".* FROM "brews"
INSERT INTO "purchases" ("customer_name", "price", "brew_id", "created_at", "updated_at", "size") VALUES (?, ?, ?, ?, ?, ?)  [["customer_name", "Stephanie"], ["price", 20.0], ["brew_id", 2], ["created_at", "2019-07-25 20:38:57.554839"], ["updated_at", "2019-07-25 20:38:57.554839"], ["size", "small"]]
---
    def create
        @brews = Brew.all
        @purchase = Purchase.new(purchase_params)
        byebug
        if @purchase.save

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def show
        @purchase = Purchase.find(params[:id])

SELECT "purchases".* FROM "purchases"
---
    def index
        @purchases = Purchase.all