20-rails-review/brews-crew/app/views/brews/show.html.erb


<% @brew.purchases.each do |purchase|%>
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."brew_id" = ?  [["brew_id", 7]]